{
  "discoveries": [
    "{FantasyPlants}"
  ],
  "FantasyPlants": [
    "Gripweed- a small green stalk that grows in warm areas. Players that try to pick a gripweed must make a DC 13 strength save or be grappled by the weed. Once grappled the weed hardens into a metallic substance and the DC then becomes 21.",
    "Glassalia- a flower made entirely of glass. These are very rare and only appear in the feywild. The flowers come in all colors of the rainbow.",
    "Cinderpetal- an orange flower that burns to the touch. If a player is careful they can pick a petal from the flower. When the petal is thrown it erupts into a fire dealing 2d4 fire damage for each petal to a max of 10d4. A cinderpetal usually only has 3 to 4 petals. A cinderpetal is extremely volatile and must be put in very special fire resistant jars otherwise they may very well ignite at an inopportune time.",
    "Frost lily- a bright blue or white flower that can be found in snowy areas. A Frost lily petal will burst when thrown doing 2d4 cold damage for each petal to a max of 10d4. A frost lily petal when placed on water will freeze the water in a 5 foot radius for each petal. Frost lilies are extremely volatile and must be placed in special cold resistant jars otherwise they may burst at inopportune times.",
    "Sand rose- a rose that grows directly in desert sand. The sand rose was made when a biomancer wizard crossed a cactus with a rose and looks much like what a cross between those two plants would look like. The rose is very rare and expensive. Many royal families in desert areas wear a sand rose in their clothing as a symbol of power.",
    "Hidden frill- a flower with a ghostlike appearance. These flowers appear where spiritual energy is active and can only be seen through true sight or astral protection.",
    "Death pearl- a weed that is black at the bottom of the plant and slowly becomes Grey at the tip of the weed. death pearls are very frail, a touch will turn a death pearl into ash. Death pearls only grow near areas with portals to the shadowfell and the shadowfell itself.",
    "Mimic moss- a moss that can shapeshift into any creature that touches it. They can move at minus 10 feet of the speed of what they have shapeshifted into. Mimic moss is carnivorous and can engulf prey. They are weak to fire and cold. Mimic moss turns into it's prey by taking the natural oil animals secrete, mimic moss cannot shapeshift into creatures that do not have natural oils like undead or some plants.",
    "Bearfruit- a fruit slightly smaller than a watermelon and grows on bearfruit trees. Those who have tasted bearfruit say it tastes like cherries and oranges with the texture of watermelon.",
    "Spiderfruit- the origins of spider fruit are unclear and have many different origin stories but the most common one was when the tabaxi asked for a favor from a nature god to give an abundance of animals to hunt so they no longer have to live a nomadic lifestyle (the nature god that the deal was made with depends on the tribe you ask) the god only asked the don't kill any buffalo. The tabaxi had failed to keep their promise. Angered, the nature god created trees that bear walking fruit that tastes of rotten flesh and slices through skin. Spiderfruit grows legs when they mature and will aggressively attack and ambush passersby. Spiderfruit comes in many different species like orange, apple, cherry, and coconut spiderfruit.",
    "Black oak- this subtype of the oak tree has black leaves and unusually large black acorns, it also has black sap that oozes out of its light gray/pink bark. Ingesting the sap in concentration will cause one to sicken and die after a few days of seemingly natural causes. Refining the sap and removing its poison however, it will prove to be a fine ink for enchanting. It is extremely effective when used to transcribe necromancy spells.",
    "Sky blossom- a flower that looks like a purple cherry blossom and has a similar blooming cycle. The trees in which sky flowers grow on are invisible and because of this it makes the flowers look as if they are growing in the sky. Some eleven cultures consider sky blossoms as a holy symbol and have a festival when they bloom.",
    "Voxberry- a fruit that is described as tasting like a banana. Anyone eating the berry must roll a d6. Depending on what the player rolls their voice will change. the lower the number the higher the pitch and the higher the number the lower the pitch. Despite their name voxberries aren't actually a type of berry and are apart of the strawberry family.",
    "Credle- a vegetable from the cauliflower family. If a dragonborn eats a Credle then the next time they use their breath weapon it fails and they vomit instead.",
    "Lightbushel- a bioluminescent bush containing poisonous berries that shed 30 feet of light. When eaten the player must make a DC 18 Con save or be poisoned.",
    "Whitleaf- a white leaf coming from a whitleaf bush. A whitleaf bush is very rare and the leaves can be refined to make potions. The potions usually involve some kind of bonus to intelligence, wisdom, or charisma for a short period of time.",
    "Spine tree- a tree made entirely of bone. They are not common but are indigionous everywhere including the arctic and deserts. They are considered a sign of bad luck.",
    "Clockwillow- a tree that makes a sound of a chiming at midnight and dawn. Clockwillows tend to grow in boreal forests together and can grow to be one of the tallest trees discovered only rivaled by the redwood.",
    "Murkweed- a poisonous underwater plant that seeps poison into the water it inhabits. Each murkweed can poison 10 feet of water in a cube per day to a max of 30 feet. Murkweed looks like much darker seaweed with red spots and are used by some natives to make potent poisons.",
    "Greatfire peppers- Red peppers that appear to be on fire, the stem and leaves of the bush these peppers grow from will not catch fire from the peppers or any other magical source, however the roots are highly explosive if made in contact with any flame. Touching a Greatfire pepper will result in 1d6 fire damage and eating one is 2d10 fire damage.",
    "Godlens- a root that is used in lots of medicines and potions. They are fairly common and they have a golden tint.",
    "Pink grass- this is grass with a pink color. This grass is only found in the feywild and does not grow very large.",
    "Skunkweed- a black and white plant that looks like grass and smells awful. skunkweed tastes extremely bitter and can treat many infections.",
    "Rageplant- a very odd looking plant that causes people to get progressively more angry while around it. The plant area of affect is a 400 foot radius. Anyone within range of the plant must make a wisdom saving throw or feel angrier. The save DC depends on how far away the target is from the plant. each creature must make a save every hour. Each time the target fails the saving throw they get angrier. After 4 failed saves they will take and extra 1d12 psychic damage whenever they take damage. The target takes an extra 2d12 after 8 failed saves and 5d12 after 10. If the target dies from this psychic damage their heart explodes from their anger. The effects end when the creature takes a long rest outside of the plants range.",
    "Elf’s Ear- a short shrub whose leaves grow in the shape of an elf’s ear, it’s very soft to the touch and grows deep within the forest. It’s often used in potions as it’s both a very good base for a potion and has great healing properties. However it’s name causes great issue within the alchemist community as it’s unclear if the recipe is calling for the plan elf’s ear or an actual elf’s ear",
    "Rumplespun - A very thin ivy with incredible strength, can be used as a rope.",
    "Greendrins- a small green four legged sentient plant that act very similarly to dogs. Many high elves keep them as pets.",
    "Shadowstalk- blooms only when in the shadow of another plant but still requires sunlight. It's dark green color makes it blend with the shadows Making it hard to find. It can be used to treat sunlight sensitivity when eaten, and give up to and hour of dark vision when brewed into a tea. Eating or drinking too much in a day will cause painful convulsions.",
    "Bludvine- a clear green vine that looks like a hose and has a spiked top at the end. Druids use bludvines to collect blood from others.",
    "Peppergrass - a golden wheatlike plant, the seeds of which explode in tiny harmless sparks when touched. minus 1 to stealth when walking through fields containing peppergrass. Can be used as a spice for cooking.",
    "Mageflower- a flower that looks like sunflowers and smell like tulips. They can come in red, blue, white, and violet. has magic within it. Anything that detects magic will show that these flowers are magic. Despite being magic they don’t have any other properties.",
    "Gabber tree- a medium size tree that grows from stone and lives off of the minerals provided in the stone.",
    "Cavern rose- a rose with a grey stem and petals pointed upwards. The roses are not actually found in caverns and are called cavern roses because any sounds created around the roses are echoed back to where the sound came from. Any thunder damage that is directed at the roses is reflected back to the attacker. If a creature wears the rose they take 3 damage less from all thunder damage. The roses can be used to make medicines for the ears, nose, and throat. Some native tabaxi tribes have been known to make armor entirely of cavern roses.",
    "Rucitinia- a green psychedelic plant that grants the user the effects of mindblank and a +3 to all saving throws. While on the effects of Rucitinia the player will see hallucinations at the dms discretion and at any moment the dm can ask you to roll a DC 22 wisdom saving throw. On a failed save you become frightened of every creature in sight and cannot speak. The effects of Rucitinia last 8 hours",
    "Mesmer - this plant is impressively gorgeous in its bloomed state, with shades of pink and blue spread about the petals. It’s shape is unnatural, almost alien, a different immense beauty. When a creature with an intelligence score of at least 4 sees this plant, it must make an intelligence saving throw, DC 14. On a fail, the target is drawn towards it, seeing hallucinations of irresistible beauty, hearing calming music and (if it can speak) the people around it encouraging it, tasting the anticipation of the plant, smelling an enticing scent, and feeling very little pain. Once ingested, the plant will distribute seeds throughout the victim’s body. If the victim is not treated within 2 days + their constitution modifier, they will be killed by the plants toxins and the victims corpse will house the seeds it needs to spread.",
    "Art blossom- a rare red lotus flower that has the constant effect of divine sense. Art blossoms can be used as a very potent medicine. Art blossoms come from a paladin named art who died fending off demons from a city. Before he died he wished for the ability to help others for generations to come. His prayers were answered and his remains became flowers scattered throughout the land.",
    "The invincible flower- a dandelion sitting atop a mountain that is indestructible. The flower cannot be picked, frozen, burned, blown away, sliced, crushed, dissolved, poisoned, or harmed in any way. Many have tried but even a wish spell cannot harm the flower. If someone buries the flower then whatever substance it has been buried with will disappear when nobody is watching the spot the flower was buried. Gods have tried to destroy the flower but have still remained unsuccessful.",
    "Cebid- a root vegetable that looks like a crystal and is in the shape of a triangular prism.",
    "Portinal- a leaf found in a bush that can be used as a spice. The spice is magical and can dull the taste of any nonmagical foods.",
    "Aquin tree- a tree found in temperate forests. The tree has a slight green tint to the brown bark. The tree emits a 30 foot aura. No fire can be lit in the radius and all magical and nonmagical fires are extinguished when entering the trees radius.",
    "Giants Salad - Gargantuan Leaves and stems resembling a fern. By all accounts, its just a larger version of an ordinary fern.",
    "Opal Tower- Long, Slender, and about 15 feet tall, this stalky plant drops solid shiny seeds resembling Opals. The seeds are used to make cheap jewelry in some cultures.",
    "Bubble Bush - A Squat plant that tends to grow in the shade beneath cloud giant castles. Residual magic dust from the above castle combines with water vapor forming bubbles on the petals of the bubble bush. These bubbles, when of sufficient size, are capable of carrying small creatures to the castle above.",
    "Grimjock Majoris- A large green plant resembling a vase, about the height of a human male. A grimjock is known to produce a powerful acid within the vase like structure. They are said to smell very sweet.",
    "Grimjock Minor- a small ferriswheel like plant, which forms from the roots of the Grimjock Majoris. once sprouted, becomes completely independent of the Grimjock Majoris and creates more Grimjock minor plants. Grimjock Minor plants act as drones attacking creatures that approach the Grimjock Majoris plants. Grimjock Minor has an ac of 4 and an HP of 5. Grimjock minor plants deal 1d4 slashing damage if it is capable of touching a creature without armor. Some variants deal an extra 2d4 acid damage.",
    "Dweomer tree- when grown in an area tainted, contaminated by, or exposed to heavy magic. (Such as a land that suffered from a magic cataclysm, a wizards tower, etc.) the hungry roots of these trees absorb magic. The magic gets stored in the trunk where it mixes with the sap turning it into a potion. In the spring one bottle of potion can be obtained this way a week after alchemical condensing the fluid to concentrate its magic.",
    "Necrotulip- the black putrid blossoms of this flower smell of rotten meat and draw pollinating flies. The wilting leaves are yellowing, dry, and brittle. The bulb is covered with what looks like sores and tumors. Though toxic and inedible this plant can be used to replace body parts of an animal or humanoid used as spell components in a necromancy spell. However there is a 1 in 10 chance that the spells target will develop plantlike traits. These tulips are typically grown by hags.",
    "Hamplant- a stumpy and lumpy plant, created by giant gods to fool Hill Giants and ogres into eating vegetables. This plant has large leafy projections which look and taste like meat.",
    "Margo- a very large plant with yellow petals and a stem as thick an two humans that grows underground near bioluminescent light sources. Margo use the water that drips from the top of the cave roof and can use any light source for photosynthesis. The plant is known as gnomehelpers because gnomes who love underground use the sap for all kinds of herbal medicines and earthy teas.",
    "Triglontide- a bush with leaves covered in a natural orange powder. The leaves secrete the powder to absorb sunlight and store it for later use. These plants grow in areas with long nights and short days. When the leaves are ground up they can be used as spices for cooking.",
    "Lakevine- Lakevine plants start as a simple creeping vine in their early stages, but grow outwards in large, flat, lipped Lilly pad shapes with great speed after a few years of absorbing nutrients. Lakevine then gradually fill their basins, which grow anywhere from 6+ feet, and collect nutrients by filtering the rainwater collected there. Water drunk from a lakevine basin is always clean, and tastes refreshing, curing one level of exhaustion. These curious plants often grow on the ground or lower canopy of tropical or dense forests.",
    "Vampire Root- A predatory desert plant that survives by leeching moisture from blood. It’s root system covers a large area under the sand, and when it senses pressure changes it grabs the offending creature and pulls them under the sand to be drained. A single enormous red flower grows at it’s center.",
    "Unshrub- A red-leaved shrub that absorbs oxygen and dispenses water, carbon dioxide and sunlight. The unshrub will also slowly eat any fruits placed inside of it.",
    "Basketbriar- Grows in a large cone spiral underwater. It's used by many tritons to make potent sleeping potions and as a way to make sealife more docile. Basketbriar can also be used as a drug which depresses the nervous system. Extended use of basketbriar will cause permanent brain damage.",
    "Gum glue root- A tuberous plant that can be ground up to create a sticky paste that has very strong Adhesive properties when dry. Can also be used to treat infections.",
    "Koszdelos- also known as nightmare fruit, they're a powerful narcotic. Eating one will kill an infant or someone with a weak constitution. Carrying them without a permit or a very good reason will result in an arrest.",
    "Inkleaf- Although inkleaf is edible alone, mixing it with alcohol creates a potent poison that goes undetected by taste and smell. To prepare the poison, soak a fistful of inkleaf in a cup of wine. When the leaves start to lose their characteristic black color, the infusion is ready. Can be used to make medicines to treat mild illnesses.",
    "Bugbell- called so because it seems to attract all manners of vermin. Although the vermin do not eat the plant, they eat any food in its vicinity and act with hostility toward other creatures. Scholars believe bugbells used to infect the food caches of a long dead civilization and that is the reason pests associate it with food and are attracted to it. It comes in many different colors and looks almost like a mushroom at first glance.",
    "Sirlith-  viewed as vile since it only grows near latrines and outhouses. Those who decide to grow sirilith use blocks of charcoal soaked in urine for months. The few who have used this plant report increased speed, enhanced reactions, and reduced strength. Sirilith is easily identified with it's brown and Grey hue. Some people from different dialects call it pissgrass.",
    "Nightingale- A dusky purple/green groundcover that grows in small clumps in temperate climes wherever fresh water flows nearby. Its flowers are a soft shade of purple fading to blue. Common knowledge says it is named nightingale for its primary use; the creation of Singer’s Tonic ; an uncommon but highly prized elven tea. Singer’s Tonic can safely be used up to 1d4 times/week. (Allowing for the varying strength of the plant) It grants the user advantage on performance checks to sing or recite poetry (DM allowing also to storytelling or oratory) for three hours. If singer’s tonic is abused the user will lose their voice for 1d4 days, and have disadvantage on social rolls involving speech for an additional 1d4 minus 1 days. Rumor has it that Nightingale is actually named for a bard who loved the goddess of magic. The goddess gently commemorated the singer’s passionate music with a flowering of the plants on their final resting place.",
    "Acidweed - A weed found growing in dry climates. It is excellent to find these weeds since they deliver adequate sustenance equal to a common meal for anyone who cooks and consumes one plant. However, there is a mild side effect. One plant consumed = 1d4 inches of a random body part turning purple with sparkling stars ...as if the skin had become the astral view through a planar gate for 1d6 hours. Stealth can become difficult dependent upon the body part affected. ",
    "Umberstalk- a purple flower with a yellow center. These flowers are very rare and give off a faint glow at night. People who see the flower must make a charisma save of DC15 or be drawn to the umberstalk. People who were drawn to the umberstalk mention how they felt more relaxed than they ever have and how their head felt like it was filling up with clouds. the umberstalk is usually surrounded by many people and animals staring at it in a hypnotic stupor. After staring for long enough to feel hungry, thirsty, tired etc the victims wander off in a dazed state and are awoken later on having little memory of what happened. Many believe this effect is an evolutionary trait to keep predators passified and unfit to do any harm to the umberstalk. Many doctors use the umberstalk as a painkiller when conducting surgeries by showing the plant to the patient and waiting for their eyes to become glossy.",
    "Snitchgrass- the name biologists prefer is corvictus patholium. Appears like normal bright green grass, but any tracks made in it will persist for a long time afterward, as if you've left footprints in snow or sand, and tiny but brightly colored bits of grass clings to you and is left in your wake until you can thoroughly clean your boots and clothing. Any tracking attempts made on a creature that has traversed through a field of snitchgrass are at +5.",
    "Chuckle Patch- A bed of white flowers similar to daisies. Innocuous except if someone makes a joke, stumbles, loads a weapon, or really does anything, they will titter and giggle. They particularly find it hilarious if someone is trying to hide. Wandering monsters always keep an ear out for Chuckle Patch.",
    "Wrathhog- a rare carnivorous swamp flower with dark red/purple, meaty petals. Wrathhog is as aggressive as it is alluring. A recreational drug, by the same name, can be alchemicaly synthesized from the leaves. The drug can be administered as desired, but once in the system, the individual must make a DC 15 wisdom saving throw or be overcome with an all consuming desire to be bear the aroma of Wrathhog. This goes back the carnivorous nature of the flower and how it lures its prey. Effects can be removed with Lesser Restoration, or after 24 hours of not smelling Wrathhog.",
    "Camas- a small flowering plant, with bluish flowers It forms edible bulbs, and only grows after fires. Spending an hour collecting bulbs yields 1d8 lbs of food and can be used as a medicine to treat almost anything including paralysis, blindness, deafness, and exhaustion. Easily confused with its counterpart death Camas. Camas are considered a sign of rebirth.",
    "Death camas- a small flowering plant, with white flowers It forms poisonous bulbs, and only grows after fires. Spending 1 hour yields 1d8 lbs of poison. Easily confused with its counterpart Camas. Camas are considered a sign of rebirth.",
    "Slingberry tree - a large, diciduous tree that forms red, fleshy fruits. The fruit form pits which are stronger then iron, and never rot. Each tree forms 2d20 fruit.",
    "Cherry tree- a large tree in the oak family that produces cherries from its vines.",
    "False Daisy- a plant that looks near identical to a daisy but has a strange magical property. This flower cannot be named. Anyone who tries to none it gets interrupted by something. Some occurrences are clocks and sounds overpowering the sound of the words naming the flower, something hitting the person before they name the flower, and some cases of people developing a speech impediment in the middle of naming the flower. A dwarf archaeologist found this flower and tried to name it but a tree fell on him and crushed him before he could do so. A bard tried naming the flower after the dwarf but unfortunately a stray fireball hit her and she was turned into ash before mentioning the dwarfs name. Most people convey the idea of talking about the flower by tilting their head left, using their left hand to make a thumbs up, and using their right hand to point down.",
    "Fred the flower- a sunflower who grew legs and decided to move to a really special place he once heard about called Eden. Fred is very friendly and will talk to the party about all the places he's been and he's been to a lot of places. Fred acts almost as if he were a mascot of a childrens television show like barney the purple dinosaur or Mr.Rogers. Fred is very educational and will share facts about areas he's been to as if he were talking to children. Fred only wants one thing from the party. In order to get to Eden he has to find a bunch of special rocks to make a portal. One of those rocks he thinks is in the abyss. Unfortunately the abyss is scary and mean. Fred knows a few devils in the nine hells that will help him but he really wants more friends to help him getting into the abyss.",
    "Blesiberry- also known as pink grapes. These berries are the size of grapes until exposed to acid. Once in they grow into the size of a tangerine. Those who aren't careful and eat too much will die from their stomach bursting.",
    "Celesyprus- a Cyprus tree that can only grow in celestia. This tree looks just like a Cyprus except the leaves are rainbow colored and the sap is melted marshmallows.",
    "Abyssal root- a vegetable from the potato family that only grows in the abyss. They are rare and only the size of a goblins fist. They taste like a heavily salted potato and are sometimes used as currency in the abyss.",
    "Spiked moss- a variant of rose moss found in warm forests. Spiked moss is covered is large brown spikes hence the name. The spikes deal 1d4 piercing and 3d10 poison damage and half as much on a successful DC14 Con save. Many green knights are known to put spiked moss on their armor.",
    "War tree- a small tree that produces arrows and bolts instead of fruit. The elves know the secret of making the variant species that produces poison arrows but that is a secret they will never tell anyone.",
    "Verdant Water weird- a variant of the water weird that is a plant. Verdant water weirds have less stealth than a normal water weird due to their different coloration. Verdant water weird have to same stat block as a water weird except with 16 con and 15 wis. Verdant water weird are also a size class larger than their counterpart, regenerate 10 HP a turn and can survive 15 hours without a water source but will desperately search for one if it no longer has a water source to be in.",
    "Arctic shambling mound- a white shambling mound only found in the arctic. It is unknown how these form but what is known is that they're hostile and carnivorous. They share the same stat block as a shambling mound except they have an immunity to cold damage, deal an extra 1d10 cold damage each attack, and have a frost breath weapon similar to a silver dragonborn.",
    "Ward lily- a lily that starts grey and smells like saltwater. Ward lilies also have a small ring around the stem. The flower starts small after a year they can grow up the 16 feet. The flower needs water, sunlight, and emotional enforcement to grow. The flower needs either encouraging words or insults daily of it will die. If the flower grows with encouragement it will give 1d6 health to to anyone friendly to the one who grew the flower in a 20 foot radius. If the flower grows with insults the plant does 2d12 necrotic damage to anyone in a 20 foot radius. The flower is resistant to all magic damage and has 130 health with 12 AC.",
    "Talosian- also known is some cultures as a Zeus spruce. A talosian creates its own rain and sun. Anyone who attacks the tree must make a DC19 dex save or be struck by lightning dealing 4d12+1 damage on a failed save. Talosians have sap with healing and medicinal properties however the tree will be hostile to those who take it. Only followers of Talos or Zeus can get the sap and leaves. You can also get the sap by praying to Talos or Zeus",
    "Mistpetal- a white or yellow flower that secretes a fog from its stem. The mist smells sweet and is used for decoration. The flowers are usually found in cold climates but can be anywhere even in caves. They grow together and 10 flowers within 5 feet of each other create 10 feet of fog that cannot be seen through.",
    "Firegrass- light green flames that can only be found in the elemental plane of fire and the City of brass. They are grown by azers and efreeti. In order to grow they need gasoline and sunlight.",
    "Cantilia- a bush found in boreal forest. The leaves can be crushed into a spice used for cooking. The spice has different properties depending on the race eating it. Ex: goblins getting +3 strength, Dragonborns changing eye color, half elves getting sick.",
    "Windsilver- a silver metallic looking bush with flowers. The bush creates a brisk wind in a 20 foot radius.",
    "Stonewood- a large Grey tree that may look dead to someone who knows little of stonewoods. Anyone who touches a stonewood must make a DC15 constitution save or be petrified. the sap of the tree is completely hard and a clear amber color. When melted the sap is a potent medicine and can be used in anti petrifaction potions.",
    "Drain lotus- also known as thieves tools to some rogues. Drain lotuses are very illegal. Drain lotuses can be crushed into a powder that causes short term memory loss in creatures. Once ingested the creature has short term memory loss for 8 hours or until a remove curse spell is cast. Eating too much will kill the creature through internal bleeding in their brain (a stroke).",
    "Dragondrops- tiny white flowers which only grow on dragon droppings (dung). The flowers are tiny, as in 1/16th of an inch or 2mm tall, but they are prolific, carpeting the dung and composting it in a matter of hours. These flowers are very expensive.",
    "Dreambane- a wild reedy plant that screeches like nails on a chalkboard any time the slightest breeze passes over them. They appear in and near the feywild.",
    "Iotomel- An herb that, depending on the alchemic process, can used to be create healing potions or potion of dominate person. Certain alchemists can also create potions that allows the effects of both. Lotimel looks spiny and has a green color with very soft leaves.",
    "Archtobacco- a special kind of tobacco that is grown through magical means. One gram of archtobacco has the strength of 8 grams of tobacco.",
    "Alchemists dye- a green plant no larger than a foot with small green pods sticking all around it. The green pods can be put in any liquid. Once put in the liquid will either change color to red or blue. If the liquid turns red it’s harmful, if the liquid turns blue it’s helpful. Alchemists are known for keeping these plants around.",
    "Dwarves beard- a plant from the bamboo family. A large stalk with orange hair. Dwarven armies use these in rituals before they fight. The plant can be mashed into paste and the paste can be used to help treat wounds. The paste can also be used in combination with other ingredients to make potent medicines.",
    "Faerie wheat- pink tinted wheat only found in the feywild. Can be used to make faerie grain and then fermented to make faerie ale. Faerie ale heals 5 of the creatures hit die and is guaranteed to make any creature drunk if they drink 1 ounce if they’re a medium creature. For every size category above medium then it’s an extra ounce. A creature cannot have alchohal poisoning by drinking faerie ale. The brewing process is very precise and must be made by skilled hands. Any mistakes could cause the faerie ale to become piss swill. Piss swill looks just like faerie are but isn’t alcoholic and tastes terrible.",
    "Pincer pine- a massive 30 foot plant that is covered in orange pine needles. These plants are only found in cool climates or in areas with snow. The plant has a 100 foot radius. Any spells in that 100 foot radius will be caught by massive ghostly pincers and dispelled. The plant can dispell 4 spells at once.",
    "Dunceleaf- A tree that twists and turns with thousands of large scratches in it and pink leaves that turn grey in the fall. When a creature sees the tree they are cursed. The curse can only be removed from moving 500 feet away from the tree or a wish spell. Once cursed the target must make a DC16 intelligence saving throw. On a failed save the creature has a minus 3 intelligence if the have a positive intelligence modifier and minus 2 if they have a negative modifier. The target must make the same saving throw every time they take a long rest until they have succeeded 3 saves, failed 3 saves or have less than 6 intelligence. All effects end when the curse is removed. Only one race is immune to the curse and that race is decided by the dungeon master.",
    "Neptune fly trap- a giant Venus fly trap that is aquatic and blue. The Neptune fly trap can cast maelstrom once a day.",
    "Stripe shoot- a bamboo shoot that once planted grows 60 feet tall and dies all within 1 minute. The plant gets its name from the dark green stripes it has.",
    "Cureroot- a very rare white turnip like root vegetable with golden leaves on top. Cureroot only grows in areas with heightened elevation and with extremely nutrient rich soil. Cureroots taste very bitter but will cure any single status ailment that afflicts the creature. If the creature is affected by multiple status ailments the cureroot cures one of them at random.",
    "Rosetta- a flower that can make a potion that has the same effect as the tongues spell. The plant looks like a sky blue feather sticking up from the ground.",
    "Stingweed- a seaweed that is described as looking like an upside down jellyfish. When touched the creature that touched it takes 3d8 electric damage.stingweed is also used in many medicines, especially the ones that prevent paralysis."
  ]
}